anthropic.claude-code
charliermarsh.ruff
davidanson.vscode-markdownlint
fill-labs.dependi
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
kilocode.kilo-code
mermaidchart.vscode-mermaid-chart
meta.pyrefly
mhutchie.git-graph
mikestead.dotenv
monokai.theme-monokai-pro-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
openai.chatgpt
qwenlm.qwen-code-vscode-ide-companion
tamasfe.even-better-toml
